// 자바스크립트 기본 및 모던(표준 2015~) 확인
console.log('hello js');
// ==============================================
/* history
- 1995년 JS 최초 탄생
- 1997 ECMA : 자바스크립트 표준화 작업 집행 기관 탄생
- ECMAScript 초안 (현재 ECMA2017) 
- 잘 사용 않되었음 => 바이러스등등 해킹으로 사용많이됨
- 2005 Ajax(구글 지도) -> 사용량 급증
- 2008 Chrome 등장 => V8 엔진 => 오픈 소스 공개 => JIT 컴파일러 변환
- 2009 nodejs가 V8 탑재하여 서버사이드 개발 언어 등장
- 2010 스마트폰 모바일 웹, 하이브리드 앱등등 => html5 표준화앞당김
- Html5, CSS3, JS => 웹 클라이언틀 구성하는 기본 요소로 자리 잡힘
- 2010 js의 문제저등등 => AltJS등장(커피스트립트, 타입스크립트)
  => typescipt 작성 -> 트랜스 컴파일 -> js 생성
- 2015 : 모던 자바 스크립트의 시작점 ES2015 표준안 발표
  => 언어적인 정립시작 -> 지원하는 브라우저 미비 -> 바벨등장
  Babel : 표준으로 작성한 JS를 호환 가능한 JS로 변환
  => 웹팩(WebPack) : js를 패킹(최소화, 난독화 등등 처리)->1줄로 
  => xxxx.min.js
- 2017년도 기준 SPA(Single Page Application) 분야 에서
  앵귤러, 리액트, 뷰에 이렇게 3개가 시장을 장악했고, 아직은 
  (앵귤러(구글), 리액트(페이스북)) > 뷰에(커뮤니티)
- PWA쪽의 발전 (2019년도)
*/
// ==============================================