// ES6 모던 자바스크립트 
// 문자열 포멧팅
// ""+""+""+""           => ` ... ${값=>변수,수식,..}... `
// 추구하는 키워드 "", '' => ''
// ============================================
const name = '간사이공항'
const text = '제비'
console.log(`[이데일리 박지혜 기자] 제21호 태풍 ‘${text}’가 일본을 강타한 가운데 5일 오사카 주재 한국총영사관은 간사이 국제공항에 고립된 한국 승객이 이날 선박을 이용해 고베 공항으로 이동하고 있다고 밝혔다.

오사카 총영사관은 이날 홈페이지를 통해 “전날 오후 3시 완전 폐쇄된 ${name}은 현재 활주로, 탑승교, 주차장 등의 침수가 단계적으로 해소되고 있으나 완전 정상화는 되지 않은 상황이고 공항 안에서는 정전상태가 일부 해제됐다. 통신수단은 유선전화는 가능하나 휴대전화 및 인터넷 사용이 불가능한 상황”이라고 전했다.

전날 ${name} 활주로 2곳 가운데 한 활주로에 바닷물이 차올라 공항이 물에 잠겼다. 태풍에 만조 시간까지 겹치면서 해발 5m 높이의 활주로도 속수무책 상태에 놓였다.

또 바다 위 섬에 있는 ${name}과 오사카 내륙을 잇는 다리에 강풍에 떠밀려온 유조선이 부딪히면서 공항 내 승객이 그대로 고립됐다.

오태규 총영사는 연합뉴스를 통해 “어제(4일) 오후 현지 항공사로의 확인과 관광객의 총영사관 문의 내용 등을 종합한 결과 (한국인) 50여 명이 고립된 것으로 추정된다”고 말했다.

이들은 고립된 다른 사람들과 함께 5일 오전 6시부터 15분 간격으로 운항하는 페리(선박)을 이용해 고베공항으로 이동하고 있다. 오사카 총영사관은 이날 중 약 3000명을 수송할 예정이라고 밝혔다.


바다 위 섬에 있는 ${name}과 오사카 내륙을 잇는 다리에 강풍에 떠밀려온 유조선이 부딪히면서 공항 내 승객이 그대로 고립됐다 (사진=AFPBBNews)
${name}의 항공편은 전편 결항됐으며 공항 복구 여부에 따라 항공편 운항이 결정될 것으로 보인다. 각 항공사에서는 간사이 지역 인근 나고야, 오카야마, 후쿠오카 공항 등 이용할 수 있도록 안내하고 있다.

또 ${name}으로 이동하는 도로, 전철, 버스, 진입 연결교 등 교통편도 전면 통제됐다. 

오사카 총영사관은 “(유조선 충돌사고가 발생한) 유일한 연결교는 일본 당국의 안전진단 등이 진행 중인 상황으로 개통 여부 결정 시 즉시 공지해 안내하겠다”고 밝혔다.


 이어 “${name}을 이용하는 우리 국민은 각 항공사 및 오사카 총영사관 홈페이지 등을 수시로 확인하고 공항 통신상황 등이 원만하지 않음에 따라 긴급한 사항이 있을 경우 오사카 총영사관에 연락을 주면 적극적으로 도움을 드리겠다”고 전했다.

오사카 총영사관은 홈페이지를 통해 ${name} 결항 상태와 고속 운행상황 등 정보를 제공하고 있다.`);
